Revit 2024 API
ParameterTypeId.CurveElemArcRadius Property
 "Radius"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId CurveElemArcRadius { get; }
Visual Basic
Public Shared ReadOnly Property CurveElemArcRadius As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CurveElemArcRadius {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace